// For Email
export const namesEmailFirst: readonly string[] = [ "ivan", "petr", "alex", "sergey", "maria", "anna", "nikita", "svetlana", "olga", "dmitry", "elena", "andrey", "irina", "viktor", "natalia", "egor", "maxim", "tatiana", "roman", "galina", "artem", "valeria", "denis", "ksenia", "boris", "arina", "timur", "sofia", "vadim", "polina", "ilya", "ekaterina", "vladimir", "milana", "anton", "alisa", "grigory", "veronika", "stanislav", "daria" ];
export const namesEmailLast: readonly string[] = [ "ivanov", "petrov", "smirnov", "sidorov", "kozlov", "volkova", "morozov", "sokolov", "novikov", "lebedev", "popova", "vasiliev", "egorova", "pavlova", "nikitina", "makarov", "fedorov", "semenov", "kuznetsova", "orlov", "zaitsev", "solovyov", "borisov", "yakovlev", "grigoriev", "romanov", "vorobyov", "sergeev", "kuzmin", "maximov", "filippov", "vlasov", "titov", "chernov", "abramov", "martynov", "efimov", "denisov", "belyaev", "terentiev" ];


// Ru Male
export const namesRuMaleFirst: readonly string[] = [ "Александр", "Максим", "Иван", "Артём", "Дмитрий", "Михаил", "Андрей", "Сергей", "Алексей", "Кирилл", "Никита", "Арсений", "Роман", "Илья", "Владислав", "Денис", "Павел", "Владимир", "Константин", "Виктор", "Олег", "Руслан", "Евгений", "Степан", "Данила", "Антон", "Игорь", "Фёдор", "Ярослав", "Станислав" ];
export const namesRuMaleLast: readonly string[] = [ "Кузнецов", "Смирнов", "Медведев", "Соколов", "Волков", "Лебедев", "Морозов", "Орлов", "Зайцев", "Соловьёв", "Гончаров", "Рыбаков", "Мельников", "Плотников", "Столяров", "Калашников", "Пастухов", "Шевцов", "Сапожников", "Кожевников", "Токарев", "Кораблёв", "Чернышёв", "Барсуков", "Воробьёв", "Синицын", "Горбачёв", "Белозёров", "Константинопольский", "Римский-Корсаков" ];
export const namesRUMalePatronymics: readonly string[] = [ "Петровна", "Николаевна", "Васильевна", "Григорьевна", "Юрьевна", "Вадимовна", "Артёмовна", "Матвеевна", "Арсеньевна", "Богдановна", "Владиславовна", "Степановна", "Тимуровна", "Руслановна", "Константиновна", "Викторовна", "Олеговна", "Игоревна", "Егоровна", "Романовна", "Денисовна", "Борисовна", "Валерьевна", "Кирилловна", "Максимовна", "Алексеевна", "Сергеевна", "Андреевна", "Михайловна", "Дмитриевна" ];

// Ru Female
export const namesRuFemaleFirst: readonly string[] =[ "Анна", "Мария", "Елена", "Ольга", "Татьяна", "Наталья", "Екатерина", "Дарья", "Анастасия", "Ирина", "Светлана", "Юлия", "Полина", "Ксения", "Виктория", "Алёна", "Валерия", "Вероника", "Елизавета", "Александра", "Кристина", "Марина", "Алиса", "Людмила", "Алина", "Василиса", "Евгения", "Ульяна", "София", "Наталья" ];
export const namesRuFemaleLast: readonly string[] = [ "Попова", "Белова", "Чернова", "Серова", "Комарова", "Рогова", "Воронова", "Лисицына", "Кочергина", "Карпова", "Сорокина", "Королёва", "Гусева", "Пчёлкина", "Цветкова", "Лаптева", "Погодина", "Грановская", "Рублёва", "Куликова", "Огородникова", "Дьяконова", "Берёзкина", "Черепанова", "Камышова", "Лунёва", "Речникова", "Забелина", "Преображенская", "Благовещенская" ];
export const namesRUFemalePatronymics: readonly string[] = [ "Александрович", "Максимович", "Иванович", "Артёмович", "Дмитриевич", "Михайлович", "Андреевич", "Сергеевич", "Алексеевич", "Кириллович", "Никитич", "Егорович", "Романович", "Ильич", "Денисович", "Павлович", "Владимирович", "Константинович", "Викторович", "Олегович", "Русланович", "Евгеньевич", "Степанович", "Данилович", "Антонович", "Игоревич", "Фёдорович", "Ярославович", "Станиславович", "Тимофеевич" ];




